/*CMD
  command: راهنمای خدمات حساب کاربری
  help: 
  need_reply: 
  auto_retry_time: 
  folder: 
  answer: 
  keyboard: 
  aliases: 
CMD*/

Api.sendChatAction({
chat_id:chat.chatid,
action:"typing"})

var Sex = User.getProperty("Sex");

var FullName = User.getProperty("FullName");

function canRun(){
var last_run_at = User.getProperty("last_run_at");
if(!last_run_at){ return true }

var minutes = (Date.now() - last_run_at) /2000;
var minutes_in_day = 2 * 2
var next = minutes_in_day - minutes
var wait_hours = Math.floor(next / 2)
next -= wait_hours * 2
var wait_minutes = Math.floor(next)
var seconds = Math.floor((next - wait_minutes) * 2)

if (minutes < minutes_in_day) {
Api.answerCallbackQuery({
callback_query_id: request.id,
text: " " + Sex + " " + FullName + " بدلیل رگبار ربات به مدت "+ seconds+" ثانیه از ربات محروم شدید.\n\n🙇‍♂لطفا به آرامی از ربات استفاده کنید.",
show_alert: true
})
return
}

return true;
}

if(!canRun()){ return }
User.setProperty("last_run_at", Date.now(), "integer");

if(request.data){
var message_id = request.message.message_id
var chat_id = request.message.chat.id

Api.deleteMessage({
chat_id :  chat_id,
message_id : message_id
})
}

Api.answerCallbackQuery({
callback_query_id: request.id,
text: "🔄راهنمای خدمات در حال بار گذاری می باشد...",
show_alert: false
})

let UserID = data.user.telegramid;

let Buttons = [
{title: "🏠بازگشت به منوی اصلی", command: "داشبورد حساب کاربری" },
];

Bot.runCommand("تاریخ و زمان");
Bot.sendInlineKeyboard(Buttons, "<Sex> [<FullName>](tg://user?id=" + UserID + ") به بخش راهنمای خدمات خوش آمدید.\n\n<DateTime>\n➖➖➖➖➖➖➖➖➖➖\n🔰دستورات و توضیحات ربات بدین شرح است:\n\n⚙دستورات اول:داشبورد حساب کاربری\n📚توضیحات دستورات:منوی داشبورد حساب کاربری\n\n⚙دستورات دوم:پروفایل کاربری\n📚توضیحات دستورات:نمایش اطلاعات پروفایل حساب کابری\n\n⚙دستورات سوم:ویرایش اطلاعات کاربری\n📚توضیحات دستورات:ویرایش اطلاعات پروفایل حساب کابری\n\n⚙دستورات چهارم:اعتبار حساب کاربری\n📚توضیحات دستورات:نمایش و افزایش اعتبار حساب کاربری\n\n⚙دستورات پنجم:انتقال اعتبار\n📚توضیحات دستورات:انتقال اعتبار حساب کاربری\n\n⚙دستورات ششم:اعتبار روزانه\n📚توضیحات دستورات:افزایش اعتبار حساب کاربری بصورت روزانه\n\n⚙دستورات هفتم:کد هدیه\n📚توضیحات دستورات:وارد کردن کد هدیه\n\n⚙دستورات هشتم:مجموعه گیری\n📚توضیحات دستورات:افزایش اعتبار لینک مجموعه گیری اختصاصی\n\n⚙دستورات نهم:ورود پلتفرم تلگرام\n📚توضیحات دستورات:ورود از طریق پلتفرم تلگرام\n\n⚙دستورات دهم:سرویس پروکسی\n📚توضیحات دستورات:خدمات پروکسی تلگرام\n\nدستورات یازدهم:فعالسازی سرویس\n📚توضیحات دستورات:فعالسازی سرویس پروکسی تلگرام\n\n⚙دستورات دوازدهم:غیر فعالسازی سرویس\n📚توضیحات دستورات:غیر فعالسازی سرویس پروکسی تلگرام\n\n⚙دستورات سیزدهم:پلتفرم اتصال پروکسی\n📚توضیحات دستورات:انتخاب پلتفرم اتصال پروکسی\n\n⚙دستورات چهاردهم:تلگرام اصلی\n📚توضیحات دستورات:انتخاب پلتفرم اتصال پروکسی تلگرام اصلی\n\n⚙دستورات پانزدهم:تلگرام پلاس\n📚توضیحات دستورات:نتخاب پلتفرم اتصال پروکسی تلگرام پلاس\n\n⚙دستورات شانزدهم:ماژول اطلاع رسانی\n📚توضیحات دستورات:منوی ماژول اطلاع رسانی\n\n⚙دستورات هفدهم:سامانه پیامکی\n📚توضیحات دستورات:ماژول سامانه پیامکی\n\n⚙دستورات هجدهم:فعالسازی سامانه\n📚توضیحات دستورات:فعالسازی ماژول سامانه پیامکی\n\n⚙دستورات نوزدهم:غیر فعالسازی سامانه\n📚توضیحات دستورات:غیر فعالسازی ماژول سامانه پیامکی\n\n⚙دستورات بیستم:سامانه ایمیلی\n📚توضیحات دستورات:ماژول سامانه ایمیلی\n\n⚙دستورات بیست و یکم:فعالسازی سامانه\n📚توضیحات دستورات:فعالسازی ماژول سامانه ایمیلی\n\n⚙دستورات بیست و دوم:غیر فعالسازی سامانه\n📚توضیحات دستورات:غیر فعالسازی ماژول سامانه ایمیلی\n\n⚙دستورات بیست و سوم:دانلود اپلیکیشن\n📚توضیحات دستورات:دانلود اپلیکیشن تلگرام اصلی و تلگرام پلاس\n\n⚙دستورات بیست و چهارم:تغیرات نسخه\n📚توضیحات دستورات:تغیرات نسخه اخیر ربات\n\n⚙دستورات بیست و پنجم:راهنمای خدمات\n📚توضیحات دستورات:دستورات و توضیحات ربات\n\n⚙دستورات بیست و ششم:پشتیبانی آنلاین\n📚توضیحات دستورات:ارتباط آنلاین مدیریت\n\n⚙دستورات بیست و هفتم:درباره پیشتاز پروکسی\n📚توضیحات دستورات:درباره ربات پیشتاز پروکسی\n➖➖➖➖➖➖➖➖➖➖\n👌جهت استفاده از امکانات ربات بر روی منوی مورد نظر کلیک کنید.");
